itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>FCR</name>
                    <description>FIFO Control Register. Controls UART FIFO usage and modes.</description>
                    <alternateRegister>IIR</alternateRegister>
                    <addressOffset>0x008</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FIFOEN</name>
                            <description>FIFO Enable.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>UARTN_FIFOS_ARE_DISA</name>
                                    <description>UARTn FIFOs are disabled. Must not be used in the
                                        application.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE_HIGH_ENABLE_F</name>
                                    <description>Active high enable for both UARTn Rx and TX FIFOs
                                        and UnFCR[7:1] access. This bit must be set for proper UART
                                        operation. Any transition on this bit will automatically
                                        clear the related UART FIFOs.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXFIFORES</name>
                            <description>RX FIFO Reset.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_IMPACT_ON_EITHER_</name>
                                    <description>No impact on either of UARTn FIFOs.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WRITING_A_LOGIC_1_TO</name>
                                    <description>Writing a logic 1 to UnFCR[1] will clear all bytes
                                        in UARTn Rx FIFO, reset the pointer logic. This bit is
                                        self-clearing.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TXFIFORES</name>
                            <description>TX FIFO Reset.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_IMPACT_ON_EITHER_</name>
                                    <description>No impact on either of UARTn FIFOs.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WRITING_A_LOGIC_1_TO</name>
                                    <description>Writing a logic 1 to UnFCR[2] will clear all bytes
                                        in UARTn TX FIFO, reset the pointer logic. This bit is
                                        self-clearing.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DMAMODE</name>
                            <description>DMA Mode Select. When the FIFO enable (bit 0 of this
                                register) is set, this bit selects the DMA mode. See Section
                                18.6.6.1.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[5:4]</bitRange>
                        </field>
                        <field>
                            <name>RXTRIGLVL</name>
                            <description>RX Trigger Level. These two bits determine how many
                                receiver UARTn FIFO characters must be written before an interrupt
                                or DMA request is activated.</description>
                            <bitRange>[7:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>TRIGGER_LEVEL_0_1_C</name>
                                    <description>Trigger level 0 (1 character or 0x01).</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRIGGER_LEVEL_1_4_C</name>
                                    <description>Trigger level 1 (4 characters or 0x04).</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRIGGER_LEVEL_2_8_C</name>
                                    <description>Trigger level 2 (8 characters or 0x08).</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TRIGGER_LEVEL_3_14_</name>
                                    <description>Trigger level 3 (14 characters or 0x0E).</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LCR</name>
                    <description>Line Control Register. Contains controls for frame formatting and
                        break generation.</description>
                    <addressOffset>0x00C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>WLS</name>
                            <description>Word Length Select.</description>
                            <bitRange>[1:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>5_BIT_CHARACTER_LENG</name>
                                    <description>5-bit character length</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6_BIT_CHARACTER_LENG</name>
                                    <description>6-bit character length</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>7_BIT_CHARACTER_LENG</name>
                                    <description>7-bit character length</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8_BIT_CHARACTER_LENG</name>
                                    <description>8-bit character length</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SBS</name>
                            <description>Stop Bit Select</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>1_STOP_BIT_</name>
                                    <description>1 stop bit.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>2_STOP_BITS_1_5_IF_</name>
                                    <description>2 stop bits (1.5 if UnLCR[1:0]=00).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>Parity Enable.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_PARITY_GENER</name>
                                    <description>Disable parity generation and checking.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_PARITY_GENERA</name>
                                    <description>Enable parity generation and checking.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PS</name>
                            <description>Parity Select</description>
                            <bitRange>[5:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ODD_PARITY_NUMBER_O</name>
                                    <description>Odd parity. Number of 1s in the transmitted
                                        character and the attached parity bit will be odd.</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVEN_PARITY_NUMBER_</name>
                                    <description>Even Parity. Number of 1s in the transmitted
                                        character and the attached parity bit will be even.</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FORCED_1_STICK_PARIT</name>
                                    <description>Forced 1 stick parity.</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FORCED_0_STICK_PARIT</name>
                                    <description>Forced 0 stick parity.</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BC</name>
                            <description>Break Control</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_BREAK_TRANSM</name>
                                    <description>Disable break transmission.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_BREAK_TRANSMI</name>
                                    <description>Enable break transmission. Output pin UARTn TXD is
                                        forced to logic 0 when UnLCR[6] is active high.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DLAB</name>
                            <description>Divisor Latch Access Bit</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLE_ACCESS_TO_DI</name>
                                    <description>Disable access to Divisor Latches.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLE_ACCESS_TO_DIV</name>
                                    <description>Enable access to Divisor Latches.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
