itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>LSR</name>
                    <description>Line Status Register. Contains flags for transmit and receive
                        status, including line errors.</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x60</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <readAction>modify</readAction>
                    <fields>
                        <field>
                            <name>RDR</name>
                            <description>Receiver Data Ready. UnLSR[0] is set when the UnRBR holds
                                an unread character and is cleared when the UARTn RBR FIFO is empty.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>The UARTn receiver FIFO is empty.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NOTEMPTY</name>
                                    <description>The UARTn receiver FIFO is not empty.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OE</name>
                            <description>Overrun Error. The overrun error condition is set as soon
                                as it occurs. An UnLSR read clears UnLSR[1]. UnLSR[1] is set when
                                UARTn RSR has a new character assembled and the UARTn RBR FIFO is
                                full. In this case, the UARTn RBR FIFO will not be overwritten and
                                the character in the UARTn RSR will be lost.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <description>Overrun error status is inactive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <description>Overrun error status is active.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>Parity Error. When the parity bit of a received character
                                is in the wrong state, a parity error occurs. An UnLSR read clears
                                UnLSR[2]. Time of parity error detection is dependent on UnFCR[0].
                                Note: A parity error is associated with the character at the top of
                                the UARTn RBR FIFO.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <description>Parity error status is inactive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <description>Parity error status is active.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FE</name>
                            <description>Framing Error. When the stop bit of a received character is
                                a logic 0, a framing error occurs. An UnLSR read clears UnLSR[3].
                                The time of the framing error detection is dependent on UnFCR[0].
                                Upon detection of a framing error, the Rx will attempt to
                                resynchronize to the data and assume that the bad stop bit is
                                actually an early start bit. However, it cannot be assumed that the
                                next received byte will be correct even if there is no Framing
                                Error. Note: A framing error is associated with the character at the
                                top of the UARTn RBR FIFO.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <description>Framing error status is inactive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <description>Framing error status is active.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BI</name>
                            <description>Break Interrupt. When RXDn is held in the spacing state
                                (all zeroes) for one full character transmission (start, data,
                                parity, stop), a break interrupt occurs. Once the break condition
                                has been detected, the receiver goes idle until RXDn goes to marking
                                state (all ones). An UnLSR read clears this status bit. The time of
                                break detection is dependent on UnFCR[0]. Note: The break interrupt
                                is associated with the character at the top of the UARTn RBR FIFO.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>INACTIVE</name>
                                    <description>Break interrupt status is inactive.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE</name>
                                    <description>Break interrupt status is active.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>THRE</name>
                            <description>Transmitter Holding Register Empty. THRE is set immediately
                                upon detection of an empty UARTn THR and is cleared on a UnTHR
                                write.</description>
                            <bitRange>[5:5]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>VALIDDATA</name>
                                    <description>UnTHR contains valid data.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>UnTHR is empty.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TEMT</name>
                            <description>Transmitter Empty. TEMT is set when both UnTHR and UnTSR
                                are empty; TEMT is cleared when either the UnTSR or the UnTHR
                                contain valid data.</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>VALIDDATA</name>
                                    <description>UnTHR and/or the UnTSR contains valid data.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>UnTHR and the UnTSR are empty.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXFE</name>
                            <description>Error in RX FIFO . UnLSR[7] is set when a character with a
                                Rx error such as framing error, parity error or break interrupt, is
                                loaded into the UnRBR. This bit is cleared when the UnLSR register
                                is read and there are no subsequent errors in the UARTn FIFO.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOERROR</name>
                                    <description>UnRBR contains no UARTn RX errors or UnFCR[0]=0.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ERRORS</name>
                                    <description>UARTn RBR contains at least one UARTn RX error.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCR</name>
                    <description>Scratch Pad Register. 8-bit temporary storage for software.</description>
                    <addressOffset>0x01C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PAD</name>
                            <description>A readable, writable byte.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ACR</name>
                    <description>Auto-baud Control Register. Contains controls for the auto-baud
                        feature.</description>
                    <addressOffset>0x020</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>Start bit. This bit is automatically cleared after
                                auto-baud completion.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>AUTO_BAUD_STOP_AUTO</name>
                                    <description>Auto-baud stop (auto-baud is not running).</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AUTO_BAUD_START_AUT</name>
                                    <description>Auto-baud start (auto-baud is running). Auto-baud
                                        run bit. This bit is automatically cleared after auto-baud
                                        completion.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>Auto-baud mode select bit.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>MODE_0_</name>
                                    <description>Mode 0.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MODE_1_</name>
                                    <description>Mode 1.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AUTORESTART</name>
                            <description>Restart bit.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_RESTART_</name>
                                    <description>No restart.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RESTART_IN_CASE_OF_T</name>
                                    <description>Restart in case of time-out (counter restarts at
                                        next UARTn Rx falling edge)</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[7:3]</bitRange>
                        </field>
                        <field>
                            <name>ABEOINTCLR</name>
                            <description>End of auto-baud interrupt clear bit (write-only
                                accessible). Writing a 1 will clear the corresponding interrupt in
                                the UnIIR. Writing a 0 has no impact.</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_IMPACT_</name>
                                    <description>No impact.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLEAR_THE_CORRESPOND</name>
                                    <description>Clear the corresponding interrupt in the IIR.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ABTOINTCLR</name>
                            <description>Auto-baud time-out interrupt clear bit (write-only
                                accessible). Writing a 1 will clear the corresponding interrupt in
                                the UnIIR. Writing a 0 has no impact.</description>
                            <bitRange>[9:9]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_IMPACT_</name>
                                    <description>No impact.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLEAR_THE_CORRESPOND</name>
                                    <description>Clear the corresponding interrupt in the IIR.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:10]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FDR</name>
                    <description>Fractional Divider Register. Generates a clock input for the baud
                        rate divider.</description>
                    <addressOffset>0x028</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x10</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DIVADDVAL</name>
                            <description>Baud-rate generation pre-scaler divisor value. If this
                                field is 0, fractional baud-rate generator will not impact the UARTn
                                baudrate.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>MULVAL</name>
                            <description>Baud-rate pre-scaler multiplier value. This field must be
                                greater or equal 1 for UARTn to operate properly, regardless of
                                whether the fractional baud-rate generator is used or not.</description>
                            <bitRange>[7:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TER</name>
                    <description>Transmit Enable Register. Turns off UART transmitter for use with
                        software flow control.</description>
                    <addressOffset>0x030</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                        <field>
                            <name>TXEN</name>
                            <description>When this bit is 1, as it is after a Reset, data written to
                                the THR is output on the TXD pin as soon as any preceding data has
                                been sent. If this bit is cleared to 0 while a character is being
                                sent, the transmission of that character is completed, but no
                                further characters are sent until this bit is set again. In other
                                words, a 0 in this bit blocks the transfer of characters from the
                                THR or TX FIFO into the transmit shift register. Software
                                implementing software-handshaking can clear this bit when it
                                receives an XOFF character (DC3). Software can set this bit again
                                when it receives an XON (DC1) character.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
