itzandroidtab/klib-svd/lpc1759.svd
                    <register>
                        <name>CLR</name>
                        <description>GPIO Interrupt Clear.</description>
                        <addressOffset>0x008</addressOffset>
                        <access>write-only</access>
                        <resetValue>0</resetValue>
                        <resetMask>0xFFFFFFFF</resetMask>
                        <fields>
                            <field>
                                <name>P_0CI</name>
                                <description>Clear GPIO port Interrupts for P[0]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>P_1CI</name>
                                <description>Clear GPIO port Interrupts for P[1]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>P_2CI</name>
                                <description>Clear GPIO port Interrupts for P[2]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[2:2]</bitRange>
                            </field>
                            <field>
                                <name>P_3CI</name>
                                <description>Clear GPIO port Interrupts for P[3]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>P_4CI</name>
                                <description>Clear GPIO port Interrupts for P[4]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>P_5CI</name>
                                <description>Clear GPIO port Interrupts for P[5]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>P_6CI</name>
                                <description>Clear GPIO port Interrupts for P[6]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>P_7CI</name>
                                <description>Clear GPIO port Interrupts for P[7]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>P_8CI</name>
                                <description>Clear GPIO port Interrupts for P[8]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>P_9CI</name>
                                <description>Clear GPIO port Interrupts for P[9]. 0 = No effect. 1 =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>P_10CI</name>
                                <description>Clear GPIO port Interrupts for P[10]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>P_11CI</name>
                                <description>Clear GPIO port Interrupts for P[11]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>P_12CI</name>
                                <description>Clear GPIO port Interrupts for P[12]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <field>
                                <name>P_13CI</name>
                                <description>Clear GPIO port Interrupts for P[13]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[13:13]</bitRange>
                            </field>
                            <field>
                                <name>P_14CI</name>
                                <description>Clear GPIO port Interrupts for P[14]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[14:14]</bitRange>
                            </field>
                            <field>
                                <name>P_15CI</name>
                                <description>Clear GPIO port Interrupts for P[15]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[15:15]</bitRange>
                            </field>
                            <field>
                                <name>P_16CI</name>
                                <description>Clear GPIO port Interrupts for P[16]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[16:16]</bitRange>
                            </field>
                            <field>
                                <name>P_17CI</name>
                                <description>Clear GPIO port Interrupts for P[17]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[17:17]</bitRange>
                            </field>
                            <field>
                                <name>P_18CI</name>
                                <description>Clear GPIO port Interrupts for P[18]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[18:18]</bitRange>
                            </field>
                            <field>
                                <name>P_19CI</name>
                                <description>Clear GPIO port Interrupts for P[19]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[19:19]</bitRange>
                            </field>
                            <field>
                                <name>P_20CI</name>
                                <description>Clear GPIO port Interrupts for P[20]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[20:20]</bitRange>
                            </field>
                            <field>
                                <name>P_21CI</name>
                                <description>Clear GPIO port Interrupts for P[21]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[21:21]</bitRange>
                            </field>
                            <field>
                                <name>P_22CI</name>
                                <description>Clear GPIO port Interrupts for P[22]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[22:22]</bitRange>
                            </field>
                            <field>
                                <name>P_23CI</name>
                                <description>Clear GPIO port Interrupts for P[23]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[23:23]</bitRange>
                            </field>
                            <field>
                                <name>P_24CI</name>
                                <description>Clear GPIO port Interrupts for P[24]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[24:24]</bitRange>
                            </field>
                            <field>
                                <name>P_25CI</name>
                                <description>Clear GPIO port Interrupts for P[25]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[25:25]</bitRange>
                            </field>
                            <field>
                                <name>P_26CI</name>
                                <description>Clear GPIO port Interrupts for P[26]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[26:26]</bitRange>
                            </field>
                            <field>
                                <name>P_27CI</name>
                                <description>Clear GPIO port Interrupts for P[27]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[27:27]</bitRange>
                            </field>
                            <field>
                                <name>P_28CI</name>
                                <description>Clear GPIO port Interrupts for P[28]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[28:28]</bitRange>
                            </field>
                            <field>
                                <name>P_29CI</name>
                                <description>Clear GPIO port Interrupts for P[29]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[29:29]</bitRange>
                            </field>
                            <field>
                                <name>P_30CI</name>
                                <description>Clear GPIO port Interrupts for P[30]. 0 = No effect. 1
                                    =
                                    Clear corresponding bits in IOnINTSTATR and IOnSTATF.</description>
                                <bitRange>[30:30]</bitRange>
                            </field>
                            <field>
                                <name>RESERVED</name>
                                <description>Reserved.</description>
                                <bitRange>[31:31]</bitRange>
                            </field>
                        </fields>
                    </register>
