itzandroidtab/klib-svd/lpc1759.svd
                    <register>
                        <name>ENR</name>
                        <description>GPIO Interrupt Enable for Rising edge for Port 0.</description>
                        <addressOffset>0x00C</addressOffset>
                        <access>read-write</access>
                        <resetValue>0</resetValue>
                        <resetMask>0xFFFFFFFF</resetMask>
                        <fields>
                            <field>
                                <name>P_0ER</name>
                                <description>Enable rising edge interrupt for P[0]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>P_1ER</name>
                                <description>Enable rising edge interrupt for P[1]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>P_2ER</name>
                                <description>Enable rising edge interrupt for P[2]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[2:2]</bitRange>
                            </field>
                            <field>
                                <name>P_3ER</name>
                                <description>Enable rising edge interrupt for P[3]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>P_4ER</name>
                                <description>Enable rising edge interrupt for P[4]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>P_5ER</name>
                                <description>Enable rising edge interrupt for P[5]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>P_6ER</name>
                                <description>Enable rising edge interrupt for P[6]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>P_7ER</name>
                                <description>Enable rising edge interrupt for P[7]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>P_8ER</name>
                                <description>Enable rising edge interrupt for P[8]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>P_9ER</name>
                                <description>Enable rising edge interrupt for P[9]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>P_10ER</name>
                                <description>Enable rising edge interrupt for P[10]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>P_11ER</name>
                                <description>Enable rising edge interrupt for P[11]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>P_12ER</name>
                                <description>Enable rising edge interrupt for P[12]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <field>
                                <name>P_13ER</name>
                                <description>Enable rising edge interrupt for P[13]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[13:13]</bitRange>
                            </field>
                            <field>
                                <name>P_14ER</name>
                                <description>Enable rising edge interrupt for P[14]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[14:14]</bitRange>
                            </field>
                            <field>
                                <name>P_15ER</name>
                                <description>Enable rising edge interrupt for P[15]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[15:15]</bitRange>
                            </field>
                            <field>
                                <name>P_16ER</name>
                                <description>Enable rising edge interrupt for P[16]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[16:16]</bitRange>
                            </field>
                            <field>
                                <name>P_17ER</name>
                                <description>Enable rising edge interrupt for P[17]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[17:17]</bitRange>
                            </field>
                            <field>
                                <name>P_18ER</name>
                                <description>Enable rising edge interrupt for P[18]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[18:18]</bitRange>
                            </field>
                            <field>
                                <name>P_19ER</name>
                                <description>Enable rising edge interrupt for P[19]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[19:19]</bitRange>
                            </field>
                            <field>
                                <name>P_20ER</name>
                                <description>Enable rising edge interrupt for P[20]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[20:20]</bitRange>
                            </field>
                            <field>
                                <name>P_21ER</name>
                                <description>Enable rising edge interrupt for P[21]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[21:21]</bitRange>
                            </field>
                            <field>
                                <name>P_22ER</name>
                                <description>Enable rising edge interrupt for P[22]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[22:22]</bitRange>
                            </field>
                            <field>
                                <name>P_23ER</name>
                                <description>Enable rising edge interrupt for P[23]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[23:23]</bitRange>
                            </field>
                            <field>
                                <name>P_24ER</name>
                                <description>Enable rising edge interrupt for P[24]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[24:24]</bitRange>
                            </field>
                            <field>
                                <name>P_25ER</name>
                                <description>Enable rising edge interrupt for P[25]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[25:25]</bitRange>
                            </field>
                            <field>
                                <name>P_26ER</name>
                                <description>Enable rising edge interrupt for P[26]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[26:26]</bitRange>
                            </field>
                            <field>
                                <name>P_27ER</name>
                                <description>Enable rising edge interrupt for P[27]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[27:27]</bitRange>
                            </field>
                            <field>
                                <name>P_28ER</name>
                                <description>Enable rising edge interrupt for P[28]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[28:28]</bitRange>
                            </field>
                            <field>
                                <name>P_29ER</name>
                                <description>Enable rising edge interrupt for P[29]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[29:29]</bitRange>
                            </field>
                            <field>
                                <name>P_30ER</name>
                                <description>Enable rising edge interrupt for P[30]. 0 = Disable
                                    rising
                                    edge interrupt. 1 = Enable rising edge interrupt.</description>
                                <bitRange>[30:30]</bitRange>
                            </field>
                            <field>
                                <name>RESERVED</name>
                                <description>Reserved.</description>
                                <bitRange>[31:31]</bitRange>
                            </field>
                        </fields>
                    </register>
