itzandroidtab/klib-svd/lpc1759.svd
                    <register>
                        <name>ENF</name>
                        <description>GPIO Interrupt Enable for Falling edge for Port 0.</description>
                        <addressOffset>0x010</addressOffset>
                        <access>read-write</access>
                        <resetValue>0</resetValue>
                        <resetMask>0xFFFFFFFF</resetMask>
                        <fields>
                            <field>
                                <name>P_0EF</name>
                                <description>Enable falling edge interrupt for P[0]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[0:0]</bitRange>
                            </field>
                            <field>
                                <name>P_1EF</name>
                                <description>Enable falling edge interrupt for P[1]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[1:1]</bitRange>
                            </field>
                            <field>
                                <name>P_2EF</name>
                                <description>Enable falling edge interrupt for P[2]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[2:2]</bitRange>
                            </field>
                            <field>
                                <name>P_3EF</name>
                                <description>Enable falling edge interrupt for P[3]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[3:3]</bitRange>
                            </field>
                            <field>
                                <name>P_4EF</name>
                                <description>Enable falling edge interrupt for P[4]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[4:4]</bitRange>
                            </field>
                            <field>
                                <name>P_5EF</name>
                                <description>Enable falling edge interrupt for P[5]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[5:5]</bitRange>
                            </field>
                            <field>
                                <name>P_6EF</name>
                                <description>Enable falling edge interrupt for P[6]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[6:6]</bitRange>
                            </field>
                            <field>
                                <name>P_7EF</name>
                                <description>Enable falling edge interrupt for P[7]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[7:7]</bitRange>
                            </field>
                            <field>
                                <name>P_8EF</name>
                                <description>Enable falling edge interrupt for P[8]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[8:8]</bitRange>
                            </field>
                            <field>
                                <name>P_9EF</name>
                                <description>Enable falling edge interrupt for P[9]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[9:9]</bitRange>
                            </field>
                            <field>
                                <name>P_10EF</name>
                                <description>Enable falling edge interrupt for P[10]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[10:10]</bitRange>
                            </field>
                            <field>
                                <name>P_11EF</name>
                                <description>Enable falling edge interrupt for P[11]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[11:11]</bitRange>
                            </field>
                            <field>
                                <name>P_12EF</name>
                                <description>Enable falling edge interrupt for P[12]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[12:12]</bitRange>
                            </field>
                            <field>
                                <name>P_13EF</name>
                                <description>Enable falling edge interrupt for P[13]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[13:13]</bitRange>
                            </field>
                            <field>
                                <name>P_14EF</name>
                                <description>Enable falling edge interrupt for P[14]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[14:14]</bitRange>
                            </field>
                            <field>
                                <name>P_15EF</name>
                                <description>Enable falling edge interrupt for P[15]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[15:15]</bitRange>
                            </field>
                            <field>
                                <name>P_16EF</name>
                                <description>Enable falling edge interrupt for P[16]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[16:16]</bitRange>
                            </field>
                            <field>
                                <name>P_17EF</name>
                                <description>Enable falling edge interrupt for P[17]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[17:17]</bitRange>
                            </field>
                            <field>
                                <name>P_18EF</name>
                                <description>Enable falling edge interrupt for P[18]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[18:18]</bitRange>
                            </field>
                            <field>
                                <name>P_19EF</name>
                                <description>Enable falling edge interrupt for P[19]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[19:19]</bitRange>
                            </field>
                            <field>
                                <name>P_20EF</name>
                                <description>Enable falling edge interrupt for P[20]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[20:20]</bitRange>
                            </field>
                            <field>
                                <name>P_21EF</name>
                                <description>Enable falling edge interrupt for P[21]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[21:21]</bitRange>
                            </field>
                            <field>
                                <name>P_22EF</name>
                                <description>Enable falling edge interrupt for P[22]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[22:22]</bitRange>
                            </field>
                            <field>
                                <name>P_23EF</name>
                                <description>Enable falling edge interrupt for P[23]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[23:23]</bitRange>
                            </field>
                            <field>
                                <name>P_24EF</name>
                                <description>Enable falling edge interrupt for P[24]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[24:24]</bitRange>
                            </field>
                            <field>
                                <name>P_25EF</name>
                                <description>Enable falling edge interrupt for P[25]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[25:25]</bitRange>
                            </field>
                            <field>
                                <name>P_26EF</name>
                                <description>Enable falling edge interrupt for P[26]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[26:26]</bitRange>
                            </field>
                            <field>
                                <name>P_27EF</name>
                                <description>Enable falling edge interrupt for P[27]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[27:27]</bitRange>
                            </field>
                            <field>
                                <name>P_28EF</name>
                                <description>Enable falling edge interrupt for P[28]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[28:28]</bitRange>
                            </field>
                            <field>
                                <name>P_29EF</name>
                                <description>Enable falling edge interrupt for P[29]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[29:29]</bitRange>
                            </field>
                            <field>
                                <name>P_30EF</name>
                                <description>Enable falling edge interrupt for P[30]. 0 = Disable
                                    falling edge interrupt. 1 = Enable falling edge interrupt.</description>
                                <bitRange>[30:30]</bitRange>
                            </field>
                            <field>
                                <name>RESERVED</name>
                                <description>Reserved.</description>
                                <bitRange>[31:31]</bitRange>
                            </field>
                        </fields>
                    </register>
                </cluster>
