itzandroidtab/klib-svd/lpc1759.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SSP0</name>
            <description>SSP0 controller</description>
            <baseAddress>0x40088000</baseAddress>
            <addressBlock>
                <offset>0</offset>
                <size>0xFFF</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SSP0</name>
                <value>14</value>
            </interrupt>
            <registers>
                <register>
                    <name>CR0</name>
                    <description>Control Register 0. Selects the serial clock rate, bus type, and
                        data size.</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DSS</name>
                            <description>Data Size Select. This field controls the number of bits
                                transferred in each frame. Values 0000-0010 are not supported and
                                should not be used.</description>
                            <bitRange>[3:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>4_BIT_TRANSFER</name>
                                    <description>4-bit transfer</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>5_BIT_TRANSFER</name>
                                    <description>5-bit transfer</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6_BIT_TRANSFER</name>
                                    <description>6-bit transfer</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>7_BIT_TRANSFER</name>
                                    <description>7-bit transfer</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>8_BIT_TRANSFER</name>
                                    <description>8-bit transfer</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>9_BIT_TRANSFER</name>
                                    <description>9-bit transfer</description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10_BIT_TRANSFER</name>
                                    <description>10-bit transfer</description>
                                    <value>0x9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11_BIT_TRANSFER</name>
                                    <description>11-bit transfer</description>
                                    <value>0xA</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12_BIT_TRANSFER</name>
                                    <description>12-bit transfer</description>
                                    <value>0xB</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>13_BIT_TRANSFER</name>
                                    <description>13-bit transfer</description>
                                    <value>0xC</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>14_BIT_TRANSFER</name>
                                    <description>14-bit transfer</description>
                                    <value>0xD</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>15_BIT_TRANSFER</name>
                                    <description>15-bit transfer</description>
                                    <value>0xE</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>16_BIT_TRANSFER</name>
                                    <description>16-bit transfer</description>
                                    <value>0xF</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FRF</name>
                            <description>Frame Format.</description>
                            <bitRange>[5:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>SPI</name>
                                    <description>SPI</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TI</name>
                                    <description>TI</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MICROWIRE</name>
                                    <description>Microwire</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THIS_COMBINATION_IS_</name>
                                    <description>This combination is not supported and should not be
                                        used.</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CPOL</name>
                            <description>Clock Out Polarity. This bit is only used in SPI mode.</description>
                            <bitRange>[6:6]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BUS_LOW</name>
                                    <description>SSP controller maintains the bus clock low between
                                        frames.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BUS_HIGH</name>
                                    <description>SSP controller maintains the bus clock high between
                                        frames.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CPHA</name>
                            <description>Clock Out Phase. This bit is only used in SPI mode.</description>
                            <bitRange>[7:7]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>FIRST_CLOCK</name>
                                    <description>SSP controller captures serial data on the first
                                        clock transition of the frame, that is, the transition away
                                        from the inter-frame state of the clock line.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SECOND_CLOCK</name>
                                    <description>SSP controller captures serial data on the second
                                        clock transition of the frame, that is, the transition back
                                        to the inter-frame state of the clock line.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SCR</name>
                            <description>Serial Clock Rate. The number of prescaler-output clocks
                                per bit on the bus, minus one. Given that CPSDVSR is the prescale
                                divider, and the APB clock PCLK clocks the prescaler, the bit
                                frequency is PCLK / (CPSDVSR X [SCR+1]).</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <description>Control Register 1. Selects master/slave and other modes.</description>
                    <addressOffset>0x004</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LBM</name>
                            <description>Loop Back Mode.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NORMAL</name>
                                    <description>During normal operation.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OUPTU</name>
                                    <description>Serial input is taken from the serial output (MOSI
                                        or MISO) rather than the serial input pin (MISO or MOSI
                                        respectively).</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SSE</name>
                            <description>SSP Enable.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DISABLED</name>
                                    <description>The SSP controller is disabled.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ENABLED</name>
                                    <description>The SSP controller will interact with other devices
                                        on the serial bus. Software should write the appropriate
                                        control information to the other SSP registers and interrupt
                                        controller registers, before setting this bit.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MS</name>
                            <description>Master/Slave Mode.This bit can only be written when the SSE
                                bit is 0.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>MASTER</name>
                                    <description>The SSP controller acts as a master on the bus,
                                        driving the SCLK, MOSI, and SSEL lines and receiving the
                                        MISO line.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SLAVE</name>
                                    <description>The SSP controller acts as a slave on the bus,
                                        driving MISO line and receiving SCLK, MOSI, and SSEL lines.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SOD</name>
                            <description>Slave Output Disable. This bit is relevant only in slave
                                mode (MS = 1). If it is 1, this blocks this SSP controller from
                                driving the transmit data line (MISO).</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR</name>
                    <description>Data Register. Writes fill the transmit FIFO, and reads empty the
                        receive FIFO.</description>
                    <addressOffset>0x008</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <readAction>modify</readAction>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Write: software can write data to be sent in a future frame
                                to this register whenever the TNF bit in the Status register is 1,
                                indicating that the Tx FIFO is not full. If the Tx FIFO was
                                previously empty and the SSP controller is not busy on the bus,
                                transmission of the data will begin immediately. Otherwise the data
                                written to this register will be sent as soon as all previous data
                                has been sent (and received). If the data length is less than 16
                                bits, software must right-justify the data written to this register.
                                Read: software can read data from this register whenever the RNE bit
                                in the Status register is 1, indicating that the Rx FIFO is not
                                empty. When software reads this register, the SSP controller returns
                                data from the least recent frame in the Rx FIFO. If the data length
                                is less than 16 bits, the data is right-justified in this field with
                                higher order bits filled with 0s.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>Status Register</description>
                    <addressOffset>0x00C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x00000003</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TFE</name>
                            <description>Transmit FIFO Empty. This bit is 1 is the Transmit FIFO is
                                empty, 0 if not.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TNF</name>
                            <description>Transmit FIFO Not Full. This bit is 0 if the Tx FIFO is
                                full, 1 if not.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RNE</name>
                            <description>Receive FIFO Not Empty. This bit is 0 if the Receive FIFO
                                is empty, 1 if not.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RFF</name>
                            <description>Receive FIFO Full. This bit is 1 if the Receive FIFO is
                                full, 0 if not.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>BSY</name>
                            <description>Busy. This bit is 0 if the SSPn controller is idle, or 1 if
                                it is currently sending/receiving a frame and/or the Tx FIFO is not
                                empty.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSR</name>
                    <description>Clock Prescale Register</description>
                    <addressOffset>0x010</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CPSDVSR</name>
                            <description>This even value between 2 and 254, by which PCLK is divided
                                to yield the prescaler output clock. Bit 0 always reads as 0.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
