itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>IER</name>
                    <description>Interrupt Enable</description>
                    <addressOffset>0x010</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RIE</name>
                            <description>Receiver Interrupt Enable. When the Receive Buffer Status
                                is 'full', the CAN Controller requests the respective interrupt.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>TIE1</name>
                            <description>Transmit Interrupt Enable for Buffer1. When a message has
                                been successfully transmitted out of TXB1 or Transmit Buffer 1 is
                                accessible again (e.g. after an Abort Transmission command), the CAN
                                Controller requests the respective interrupt.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EIE</name>
                            <description>Error Warning Interrupt Enable. If the Error or Bus Status
                                change (see Status Register), the CAN Controller requests the
                                respective interrupt.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>DOIE</name>
                            <description>Data Overrun Interrupt Enable. If the Data Overrun Status
                                bit is set (see Status Register), the CAN Controller requests the
                                respective interrupt.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>WUIE</name>
                            <description>Wake-Up Interrupt Enable. If the sleeping CAN controller
                                wakes up, the respective interrupt is requested.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPIE</name>
                            <description>Error Passive Interrupt Enable. If the error status of the
                                CAN Controller changes from error active to error passive or vice
                                versa, the respective interrupt is requested.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>ALIE</name>
                            <description>Arbitration Lost Interrupt Enable. If the CAN Controller
                                has lost arbitration, the respective interrupt is requested.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>BEIE</name>
                            <description>Bus Error Interrupt Enable. If a bus error has been
                                detected, the CAN Controller requests the respective interrupt.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>IDIE</name>
                            <description>ID Ready Interrupt Enable. When a CAN identifier has been
                                received, the CAN Controller requests the respective interrupt.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>TIE2</name>
                            <description>Transmit Interrupt Enable for Buffer2. When a message has
                                been successfully transmitted out of TXB2 or Transmit Buffer 2 is
                                accessible again (e.g. after an Abort Transmission command), the CAN
                                Controller requests the respective interrupt.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>TIE3</name>
                            <description>Transmit Interrupt Enable for Buffer3. When a message has
                                been successfully transmitted out of TXB3 or Transmit Buffer 3 is
                                accessible again (e.g. after an Abort Transmission command), the CAN
                                Controller requests the respective interrupt.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:11]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BTR</name>
                    <description>Bus Timing. Can only be written when RM in CANMOD is 1.</description>
                    <addressOffset>0x014</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x1C0000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BRP</name>
                            <description>Baud Rate Prescaler. The APB clock is divided by (this
                                value plus one) to produce the CAN clock.</description>
                            <bitRange>[9:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[13:10]</bitRange>
                        </field>
                        <field>
                            <name>SJW</name>
                            <description>The Synchronization Jump Width is (this value plus one) CAN
                                clocks.</description>
                            <bitRange>[15:14]</bitRange>
                        </field>
                        <field>
                            <name>TESG1</name>
                            <description>The delay from the nominal Sync point to the sample point
                                is (this value plus one) CAN clocks.</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>TESG2</name>
                            <description>The delay from the sample point to the next nominal sync
                                point is (this value plus one) CAN clocks. The nominal CAN bit time
                                is (this value plus the value in TSEG1 plus 3) CAN clocks.</description>
                            <bitRange>[22:20]</bitRange>
                        </field>
                        <field>
                            <name>SAM</name>
                            <description>Sampling</description>
                            <bitRange>[23:23]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>THE_BUS_IS_SAMPLED_O</name>
                                    <description>The bus is sampled once (recommended for high speed
                                        buses)</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>THE_BUS_IS_SAMPLED_3</name>
                                    <description>The bus is sampled 3 times (recommended for low to
                                        medium speed buses to filter spikes on the bus-line)</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EWL</name>
                    <description>Error Warning Limit. Can only be written when RM in CANMOD is 1.</description>
                    <addressOffset>0x018</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x60</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EWL</name>
                            <description>During CAN operation, this value is compared to both the Tx
                                and Rx Error Counters. If either of these counter matches this
                                value, the Error Status (ES) bit in CANSR is set.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
