itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>PLL1STAT</name>
                    <description>PLL1 Status Register</description>
                    <addressOffset>0x0A8</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MSEL1</name>
                            <description>Read-back for the PLL1 Multiplier value. This is the value
                                currently used by PLL1.</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                        <field>
                            <name>PSEL1</name>
                            <description>Read-back for the PLL1 Divider value. This is the value
                                currently used by PLL1.</description>
                            <bitRange>[6:5]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>PLLE1_STAT</name>
                            <description>Read-back for the PLL1 Enable bit. When one, PLL1 is
                                currently activated. When zero, PLL1 is turned off. This bit is
                                automatically cleared when Power-down mode is activated.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>PLLC1_STAT</name>
                            <description>Read-back for the PLL1 Connect bit. When PLLC and PLLE are
                                both one, PLL1 is connected as the clock source for the
                                microcontroller. When either PLLC or PLLE is zero, PLL1 is bypassed
                                and the oscillator clock is used directly by the microcontroller.
                                This bit is automatically cleared when Power-down mode is activated.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>PLOCK1</name>
                            <description>Reflects the PLL1 Lock status. When zero, PLL1 is not
                                locked. When one, PLL1 is locked onto the requested frequency.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:11]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL1FEED</name>
                    <description>PLL1 Feed Register</description>
                    <addressOffset>0x0AC</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>PLL1FEED</name>
                            <description>The PLL1 feed sequence must be written to this register in
                                order for PLL1 configuration and control register changes to take
                                effect.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCON</name>
                    <description>Power Control Register</description>
                    <addressOffset>0x0C0</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PM0</name>
                            <description>Power mode control bit 0. This bit controls entry to the
                                Power-down mode.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PM1</name>
                            <description>Power mode control bit 1. This bit controls entry to the
                                Deep Power-down mode.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>BODRPM</name>
                            <description>Brown-Out Reduced Power Mode. When BODRPM is 1, the
                                Brown-Out Detect circuitry will be turned off when chip Power-down
                                mode or Deep Sleep mode is entered, resulting in a further reduction
                                in power usage. However, the possibility of using Brown-Out Detect
                                as a wake-up source from the reduced power mode will be lost. When
                                0, the Brown-Out Detect function remains active during Power-down
                                and Deep Sleep modes. See the System Control Block chapter for
                                details of Brown-Out detection.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>BOGD</name>
                            <description>Brown-Out Global Disable. When BOGD is 1, the Brown-Out
                                Detect circuitry is fully disabled at all times, and does not
                                consume power. When 0, the Brown-Out Detect circuitry is enabled.
                                See the System Control Block chapter for details of Brown-Out
                                detection. Note: the Brown-Out Reset Disable (BORD, in this
                                register) and the Brown-Out Interrupt (xx) must be disabled when
                                software changes the value of this bit.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>BORD</name>
                            <description>Brown-Out Reset Disable. When BORD is 1, the BOD will not
                                reset the device when the VDD(REG)(3V3) voltage dips goes below the
                                BOD reset trip level. The Brown-Out interrupt is not affected. When
                                BORD is 0, the BOD reset is enabled.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[7:3]</bitRange>
                        </field>
                        <field>
                            <name>SMFLAG</name>
                            <description>Sleep Mode entry flag. Set when the Sleep mode is
                                successfully entered. Cleared by software writing a one to this bit.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>DSFLAG</name>
                            <description>Deep Sleep entry flag. Set when the Deep Sleep mode is
                                successfully entered. Cleared by software writing a one to this bit.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>PDFLAG</name>
                            <description>Power-down entry flag. Set when the Power-down mode is
                                successfully entered. Cleared by software writing a one to this bit.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>DPDFLAG</name>
                            <description>Deep Power-down entry flag. Set when the Deep Power-down
                                mode is successfully entered. Cleared by software writing a one to
                                this bit.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCONP</name>
                    <description>Power Control for Peripherals Register</description>
                    <addressOffset>0x0C4</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x03BE</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>PCTIM0</name>
                            <description>Timer/Counter 0 power/clock control bit.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>PCTIM1</name>
                            <description>Timer/Counter 1 power/clock control bit.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PCUART0</name>
                            <description>UART0 power/clock control bit.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>PCUART1</name>
                            <description>UART1 power/clock control bit.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>PCPWM1</name>
                            <description>PWM1 power/clock control bit.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>PCI2C0</name>
                            <description>The I2C0 interface power/clock control bit.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>PCSPI</name>
                            <description>The SPI interface power/clock control bit.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>PCRTC</name>
                            <description>The RTC power/clock control bit.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>PCSSP1</name>
                            <description>The SSP 1 interface power/clock control bit.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>PCADC</name>
                            <description>A/D converter (ADC) power/clock control bit. Note: Clear
                                the PDN bit in the AD0CR before clearing this bit, and set this bit
                                before setting PDN.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>PCCAN1</name>
                            <description>CAN Controller 1 power/clock control bit.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>PCCAN2</name>
                            <description>CAN Controller 2 power/clock control bit.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>PCGPIO</name>
                            <description>Power/clock control bit for IOCON, GPIO, and GPIO
                                interrupts.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>PCRIT</name>
                            <description>Repetitive Interrupt Timer power/clock control bit.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>PCMCPWM</name>
                            <description>Motor Control PWM</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>PCQEI</name>
                            <description>Quadrature Encoder Interface power/clock control bit.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>PCI2C1</name>
                            <description>The I2C1 interface power/clock control bit.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>PCSSP0</name>
                            <description>The SSP0 interface power/clock control bit.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>PCTIM2</name>
                            <description>Timer 2 power/clock control bit.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>PCTIM3</name>
                            <description>Timer 3 power/clock control bit.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>PCUART2</name>
                            <description>UART 2 power/clock control bit.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>PCUART3</name>
                            <description>UART 3 power/clock control bit.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>PCI2C2</name>
                            <description>I2C interface 2 power/clock control bit.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>PCI2S</name>
                            <description>I2S interface power/clock control bit.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>PCGPDMA</name>
                            <description>GPDMA function power/clock control bit.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>PCENET</name>
                            <description>Ethernet block power/clock control bit.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>PCUSB</name>
                            <description>USB interface power/clock control bit.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCLKCFG</name>
                    <description>CPU Clock Configuration Register</description>
                    <addressOffset>0x104</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CCLKSEL</name>
                            <description>Selects the divide value for creating the CPU clock (CCLK)
                                from the PLL0 output. 0 = pllclk is divided by 1 to produce the CPU
                                clock. This setting is not allowed when the PLL0 is connected,
                                because the rate would always be greater than the maximum allowed
                                CPU clock. 1 = pllclk is divided by 2 to produce the CPU clock. This
                                setting is not allowed when the PLL0 is connected, because the rate
                                would always be greater than the maximum allowed CPU clock. 2 =
                                pllclk is divided by 3 to produce the CPU clock. 3 = pllclk is
                                divided by 4 to produce the CPU clock. ... 255 = pllclk is divided
                                by 256 to produce the CPU clock.</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USBCLKCFG</name>
                    <description>USB Clock Configuration Register</description>
                    <addressOffset>0x108</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>USBSEL</name>
                            <description>Selects the divide value for creating the USB clock from
                                the PLL0 output. Only the values shown below can produce even number
                                multiples of 48 MHz from the PLL0 output. Warning: Improper setting
                                of this value will result in incorrect operation of the USB
                                interface. 5 = PLL0 output is divided by 6. PLL0 output must be 288
                                MHz. 7 = PLL0 output is divided by 8. PLL0 output must be 384 MHz. 9
                                = PLL0 output is divided by 10. PLL0 output must be 480 MHz.</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved, user software should not write ones to reserved
                                bits. The value read from a reserved bit is not defined.</description>
                            <bitRange>[31:4]</bitRange>
                        </field>
                    </fields>
                </register>
