itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>RXDESCRIPTORNUMBER</name>
                    <description>Receive number of descriptors register.</description>
                    <addressOffset>0x110</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXDESCRIPTORN</name>
                            <description>RxDescriptorNumber. Number of descriptors in the descriptor
                                array for which RxDescriptor is the base address. The number of
                                descriptors is minus one encoded.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXPRODUCEINDEX</name>
                    <description>Receive produce index register.</description>
                    <addressOffset>0x114</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXPRODUCEIX</name>
                            <description>Index of the descriptor that is going to be filled next by
                                the receive datapath.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXCONSUMEINDEX</name>
                    <description>Receive consume index register.</description>
                    <addressOffset>0x118</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RXCONSUMEIX</name>
                            <description>Index of the descriptor that is going to be processed next
                                by the receive</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXDESCRIPTOR</name>
                    <description>Transmit descriptor base address register.</description>
                    <addressOffset>0x11C</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Fixed to 00</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>TXD</name>
                            <description>TxDescriptor. MSBs of transmit descriptor base address.</description>
                            <bitRange>[31:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXSTATUS</name>
                    <description>Transmit status base address register.</description>
                    <addressOffset>0x120</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Fixed to 00</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>TXSTAT</name>
                            <description>TxStatus. MSBs of transmit status base address.</description>
                            <bitRange>[31:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXDESCRIPTORNUMBER</name>
                    <description>Transmit number of descriptors register.</description>
                    <addressOffset>0x124</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TXDN</name>
                            <description>TxDescriptorNumber. Number of descriptors in the descriptor
                                array for which TxDescriptor is the base address. The register is
                                minus one encoded.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXPRODUCEINDEX</name>
                    <description>Transmit produce index register.</description>
                    <addressOffset>0x128</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TXPI</name>
                            <description>TxProduceIndex. Index of the descriptor that is going to be
                                filled next by the transmit software driver.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXCONSUMEINDEX</name>
                    <description>Transmit consume index register.</description>
                    <addressOffset>0x12C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TXCI</name>
                            <description>TxConsumeIndex. Index of the descriptor that is going to be
                                transmitted next by the transmit datapath.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSV0</name>
                    <description>Transmit status vector 0 register.</description>
                    <addressOffset>0x158</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCERR</name>
                            <description>CRC error. The attached CRC in the packet did not match the
                                internally generated CRC.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>LCE</name>
                            <description>Length check error. Indicates the frame length field does
                                not match the actual number of data items and is not a type field.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>LOR</name>
                            <description>Length out of range. Indicates that frame type/length field
                                was larger than 1500 bytes. The EMAC doesn't distinguish the frame
                                type and frame length, so, e.g. when the IP(0x8000) or ARP(0x0806)
                                packets are received, it compares the frame type with the max length
                                and gives the "Length out of range" error. In fact, this bit is not
                                an error indication, but simply a statement by the chip regarding
                                the status of the received frame.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>DONE</name>
                            <description>Transmission of packet was completed.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>MULTICAST</name>
                            <description>Packet's destination was a multicast address.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>BROADCAST</name>
                            <description>Packet's destination was a broadcast address.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>PACKETDEFER</name>
                            <description>Packet was deferred for at least one attempt, but less than
                                an excessive defer.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EXDF</name>
                            <description>Excessive Defer. Packet was deferred in excess of 6071
                                nibble times in 100 Mbps or 24287 bit times in 10 Mbps mode.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EXCOL</name>
                            <description>Excessive Collision. Packet was aborted due to exceeding of
                                maximum allowed number of collisions.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>LCOL</name>
                            <description>Late Collision. Collision occurred beyond collision window,
                                512 bit times.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>GIANT</name>
                            <description>Byte count in frame was greater than can be represented in
                                the transmit byte count field in TSV1.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>UNDERRUN</name>
                            <description>Host side caused buffer underrun.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>TOTALBYTES</name>
                            <description>The total number of bytes transferred including collided
                                attempts.</description>
                            <bitRange>[27:12]</bitRange>
                        </field>
                        <field>
                            <name>CONTROLFRAME</name>
                            <description>The frame was a control frame.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>PAUSE</name>
                            <description>The frame was a control frame with a valid PAUSE opcode.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>BACKPRESSURE</name>
                            <description>Carrier-sense method backpressure was previously applied.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>VLAN</name>
                            <description>Frame's length/type field contained 0x8100 which is the
                                VLAN protocol identifier.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSV1</name>
                    <description>Transmit status vector 1 register.</description>
                    <addressOffset>0x15C</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TBC</name>
                            <description>Transmit byte count. The total number of bytes in the
                                frame, not counting the collided bytes.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>TCC</name>
                            <description>Transmit collision count. Number of collisions the current
                                packet incurred during transmission attempts. The maximum number of
                                collisions (16) cannot be represented.</description>
                            <bitRange>[19:16]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:20]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSV</name>
                    <description>Receive status vector register.</description>
                    <addressOffset>0x160</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RBC</name>
                            <description>Received byte count. Indicates length of received frame.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>PPI</name>
                            <description>Packet previously ignored. Indicates that a packet was
                                dropped.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>RXDVSEEN</name>
                            <description>RXDV event previously seen. Indicates that the last receive
                                event seen was not long enough to be a valid packet.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>CESEEN</name>
                            <description>Carrier event previously seen. Indicates that at some time
                                since the last receive statistics, a carrier event was detected.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>RCV</name>
                            <description>Receive code violation. Indicates that received PHY data
                                does not represent a valid receive code.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>CRCERR</name>
                            <description>CRC error. The attached CRC in the packet did not match the
                                internally generated CRC.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>LCERR</name>
                            <description>Length check error. Indicates the frame length field does
                                not match the actual number of data items and is not a type field.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>LOR</name>
                            <description>Length out of range. Indicates that frame type/length field
                                was larger than 1518 bytes. The EMAC doesn't distinguish the frame
                                type and frame length, so, e.g. when the IP(0x8000) or ARP(0x0806)
                                packets are received, it compares the frame type with the max length
                                and gives the "Length out of range" error. In fact, this bit is not
                                an error indication, but simply a statement by the chip regarding
                                the status of the received frame.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>ROK</name>
                            <description>Receive OK. The packet had valid CRC and no symbol errors.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>MULTICAST</name>
                            <description>The packet destination was a multicast address.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>BROADCAST</name>
                            <description>The packet destination was a broadcast address.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>DRIBBLENIBBLE</name>
                            <description>Indicates that after the end of packet another 1-7 bits
                                were received. A single nibble, called dribble nibble, is formed but
                                not sent out.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>CONTROLFRAME</name>
                            <description>The frame was a control frame.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>PAUSE</name>
                            <description>The frame was a control frame with a valid PAUSE opcode.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>UO</name>
                            <description>Unsupported Opcode. The current frame was recognized as a
                                Control Frame but contains an unknown opcode.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>VLAN</name>
                            <description>Frame's length/type field contained 0x8100 which is the
                                VLAN protocol identifier.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Unused</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLOWCONTROLCOUNTER</name>
                    <description>Flow control counter register.</description>
                    <addressOffset>0x170</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>MC</name>
                            <description>MirrorCounter. In full duplex mode the MirrorCounter
                                specifies the number of cycles before re-issuing the Pause control
                                frame.</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                        <field>
                            <name>PT</name>
                            <description>PauseTimer. In full-duplex mode the PauseTimer specifies
                                the value that is inserted into the pause timer field of a pause
                                flow control frame. In half duplex mode the PauseTimer specifies the
                                number of backpressure cycles.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
