itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>SOFTBREQ</name>
                    <description>DMA Software Burst Request Register</description>
                    <addressOffset>0x020</addressOffset>
                    <access>read-write</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFTBREQ0</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ1</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ2</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ3</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ4</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ5</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ6</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ7</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ8</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ9</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ10</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ11</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ12</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ13</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ14</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>SOFTBREQ15</name>
                            <description>Software burst request flags for each of 16 possible
                                sources. Each bit represents one DMA request line or peripheral
                                Description (refer to Table 672 for peripheral hardware connections
                                to the DMA controller): 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA burst request for the corresponding request line.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOFTSREQ</name>
                    <description>DMA Software Single Request Register</description>
                    <addressOffset>0x024</addressOffset>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SOFTSREQ0</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ1</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ2</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ3</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ4</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ5</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ6</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ7</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ8</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ9</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ10</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ11</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ12</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ13</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ14</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>SOFTSREQ15</name>
                            <description>Software single transfer request flags for each of 16
                                possible sources. Each bit represents one DMA request line or
                                peripheral function: 0 - writing 0 has no effect. 1 - writing 1
                                generates a DMA single transfer request for the corresponding
                                request line.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read undefined. Write reserved bits as zero.</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
