itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>EOTINTSET</name>
                    <description>USB End of Transfer Interrupt Set</description>
                    <addressOffset>0x2A8</addressOffset>
                    <access>write-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EPTXINTSET0</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET1</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET2</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET3</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET4</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET5</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET6</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET7</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET8</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET9</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET10</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET11</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET12</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET13</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET14</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET15</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET16</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET17</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET18</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET19</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET20</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET21</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET22</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET23</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET24</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET25</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET26</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET27</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET28</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET29</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET30</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>EPTXINTSET31</name>
                            <description>Set endpoint xx (2 &lt;= xx &lt;= 31) End of Transfer
                                Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer
                                Interrupt request in the USBEoTIntSt register.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
