itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>SYSERRINTST</name>
                    <description>USB System Error Interrupt Status</description>
                    <addressOffset>0x2B8</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EPERRINTST0</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST1</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST2</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST3</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST4</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST5</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST6</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST7</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST8</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST9</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST10</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[10:10]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST11</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[11:11]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST12</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[12:12]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST13</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[13:13]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST14</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[14:14]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST15</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[15:15]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST16</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[16:16]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST17</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[17:17]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST18</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[18:18]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST19</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[19:19]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST20</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[20:20]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST21</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[21:21]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST22</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[22:22]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST23</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[23:23]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST24</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[24:24]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST25</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[25:25]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST26</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[26:26]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST27</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[27:27]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST28</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[28:28]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST29</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[29:29]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST30</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[30:30]</bitRange>
                        </field>
                        <field>
                            <name>EPERRINTST31</name>
                            <description>Endpoint xx (2 &lt;= xx &lt;= 31) System Error Interrupt
                                request. 0 = There is no System Error Interrupt request for endpoint
                                xx. 1 = There is a System Error Interrupt request for endpoint xx.</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
