itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>I2C_STS</name>
                    <description>I2C Status</description>
                    <addressOffset>0x304</addressOffset>
                    <access>read-only</access>
                    <resetValue>0x0A00</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDI</name>
                            <description>Transaction Done Interrupt. This flag is set if a
                                transaction completes successfully. It is cleared by writing a one
                                to bit 0 of the status register. It is unaffected by slave
                                transactions.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NOT_COMPLETE</name>
                                    <description>Transaction has not completed.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>COMPLETE</name>
                                    <description>Transaction completed.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AFI</name>
                            <description>Arbitration Failure Interrupt. When transmitting, if the
                                SDA is low when SDAOUT is high, then this I2C has lost the
                                arbitration to another device on the bus. The Arbitration Failure
                                bit is set when this happens. It is cleared by writing a one to bit
                                1 of the status register.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>NO_ARBITRATION_FAILU</name>
                                    <description>No arbitration failure on last transmission.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ARBITRATION_FAILURE_</name>
                                    <description>Arbitration failure occurred on last transmission.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NAI</name>
                            <description>No Acknowledge Interrupt. After every byte of data is sent,
                                the transmitter expects an acknowledge from the receiver. This bit
                                is set if the acknowledge is not received. It is cleared when a byte
                                is written to the master TX FIFO.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>ACKNOWLEDGE_RCVD</name>
                                    <description>Last transmission received an acknowledge.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NO_ACKNOWLEDGE_RCVD</name>
                                    <description>Last transmission did not receive an acknowledge.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DRMI</name>
                            <description>Master Data Request Interrupt. Once a transmission is
                                started, the transmitter must have data to transmit as long as it
                                isn't followed by a stop condition or it will hold SCL low until
                                more data is available. The Master Data Request bit is set when the
                                master transmitter is data-starved. If the master TX FIFO is empty
                                and the last byte did not have a STOP condition flag, then SCL is
                                held low until the CPU writes another byte to transmit. This bit is
                                cleared when a byte is written to the master TX FIFO.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BUSY</name>
                                    <description>Master transmitter does not need data.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEED_DATA</name>
                                    <description>Master transmitter needs data.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DRSI</name>
                            <description>Slave Data Request Interrupt. Once a transmission is
                                started, the transmitter must have data to transmit as long as it
                                isn't followed by a STOP condition or it will hold SCL low until
                                more data is available. The Slave Data Request bit is set when the
                                slave transmitter is data-starved. If the slave TX FIFO is empty and
                                the last byte transmitted was acknowledged, then SCL is held low
                                until the CPU writes another byte to transmit. This bit is cleared
                                when a byte is written to the slave Tx FIFO.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>BUSY</name>
                                    <description>Slave transmitter does not need data.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEED_DATA</name>
                                    <description>Slave transmitter needs data.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Active</name>
                            <description>Indicates whether the bus is busy. This bit is set when a
                                START condition has been seen. It is cleared when a STOP condition
                                is seen..</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>SCL</name>
                            <description>The current value of the SCL signal.</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>SDA</name>
                            <description>The current value of the SDA signal.</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>RFF</name>
                            <description>Receive FIFO Full (RFF). This bit is set when the RX FIFO
                                is full and cannot accept any more data. It is cleared when the RX
                                FIFO is not full. If a byte arrives when the Receive FIFO is full,
                                the SCL is held low until the CPU reads the RX FIFO and makes room
                                for it.</description>
                            <bitRange>[8:8]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>RX_FIFO_IS_NOT_FULL</name>
                                    <description>RX FIFO is not full</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RX_FIFO_IS_FULL</name>
                                    <description>RX FIFO is full</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RFE</name>
                            <description>Receive FIFO Empty. RFE is set when the RX FIFO is empty
                                and is cleared when the RX FIFO contains valid data.</description>
                            <bitRange>[9:9]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DATA</name>
                                    <description>RX FIFO contains data.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>RX FIFO is empty</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TFF</name>
                            <description>Transmit FIFO Full. TFF is set when the TX FIFO is full and
                                is cleared when the TX FIFO is not full.</description>
                            <bitRange>[10:10]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>TX_FIFO_IS_NOT_FULL_</name>
                                    <description>TX FIFO is not full.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TX_FIFO_IS_FULL</name>
                                    <description>TX FIFO is full</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TFE</name>
                            <description>Transmit FIFO Empty. TFE is set when the TX FIFO is empty
                                and is cleared when the TX FIFO contains valid data.</description>
                            <bitRange>[11:11]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>VALID_DATA</name>
                                    <description>TX FIFO contains valid data.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EMPTY</name>
                                    <description>TX FIFO is empty</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
