itzandroidtab/klib-svd/lpc1759.svd
                <register>
                    <name>USBCLKST</name>
                    <description>USB Clock Status</description>
                    <addressOffset>0xFF8</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>DEV_CLK_ON</name>
                            <description>Device clock on. The usbclk input to the device controller
                                is active .</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>PORTSEL_CLK_ON</name>
                            <description>Port select register clock on.</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>AHB_CLK_ON</name>
                            <description>AHB clock on.</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. The value read from a reserved bit is not
                                defined.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OTGCLKST</name>
                    <description>OTG clock status</description>
                    <alternateRegister>USBCLKST</alternateRegister>
                    <addressOffset>0xFF8</addressOffset>
                    <access>read-only</access>
                    <resetValue>0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HOST_CLK_ON</name>
                            <description>Host clock status.</description>
                            <bitRange>[0:0]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>HOST_CLOCK_IS_NOT_AV</name>
                                    <description>Host clock is not available.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HOST_CLOCK_IS_AVAILA</name>
                                    <description>Host clock is available.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DEV_CLK_ON</name>
                            <description>Device clock status.</description>
                            <bitRange>[1:1]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>DEVICE_CLOCK_IS_NOT_</name>
                                    <description>Device clock is not available.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DEVICE_CLOCK_IS_AVAI</name>
                                    <description>Device clock is available.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>I2C_CLK_ON</name>
                            <description>I2C clock status.</description>
                            <bitRange>[2:2]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>I2C_CLOCK_IS_NOT_AVA</name>
                                    <description>I2C clock is not available.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I2C_CLOCK_IS_AVAILAB</name>
                                    <description>I2C clock is available.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OTG_CLK_ON</name>
                            <description>OTG clock status.</description>
                            <bitRange>[3:3]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>OTG_CLOCK_IS_NOT_AVA</name>
                                    <description>OTG clock is not available.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OTG_CLOCK_IS_AVAILAB</name>
                                    <description>OTG clock is available.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AHB_CLK_ON</name>
                            <description>AHB master clock status.</description>
                            <bitRange>[4:4]</bitRange>
                            <enumeratedValues>
                                <name>ENUM</name>
                                <enumeratedValue>
                                    <name>AHB_CLOCK_IS_NOT_AVA</name>
                                    <description>AHB clock is not available.</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>AHB_CLOCK_IS_AVAILAB</name>
                                    <description>AHB clock is available.</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RESERVED</name>
                            <description>Reserved. Read value is undefined, only zero should be
                                written.</description>
                            <bitRange>[31:5]</bitRange>
                        </field>
                    </fields>
                </register>
